4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_ll_usb.c
/**
  ******************************************************************************
  * @file    stm32mp1xx_ll_usb.c
  * @author  Dan Green, converted from h7 version by MCD Application Team
  * @brief   USB Low Layer HAL module driver.
  *
  *          This file provides firmware functions to manage the following
  *          functionalities of the USB Peripheral Controller:
  *           + Initialization/de-initialization functions
  *           + I/O operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
					##### How to use this driver #####
  ==============================================================================
	[..]
	  (#) Fill parameters of Init structure in USB_OTG_CfgTypeDef structure.

	  (#) Call USB_CoreInit() API to initialize the USB Core peripheral.

	  (#) The upper HAL HCD/PCD driver will call the right routines for its internal processes.

  @endverbatim

  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx_hal.h"
#include "stm32mp1xx_ll_rcc.h"
#include <stdlib.h> //For ldiv

/** @addtogroup STM32MP1xx_LL_USB_DRIVER
 * @{
 */

#if defined(HAL_PCD_MODULE_ENABLED) || defined(HAL_HCD_MODULE_ENABLED)
#if defined(USB_OTG_FS) || defined(USB_OTG_HS)
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
#if defined(USB_OTG_FS) || defined(USB_OTG_HS)
static HAL_StatusTypeDef USB_CoreReset(USB_OTG_GlobalTypeDef *USBx);

/* Exported functions --------------------------------------------------------*/
/** @defgroup USB_LL_Exported_Functions USB Low Layer Exported Functions
 * @{
 */

/** @defgroup USB_LL_Exported_Functions_Group1 Initialization/de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
					  ##### Initialization/de-initialization functions #####
 ===============================================================================

@endverbatim
  * @{
  */

// Modification here: Function from hftrx
HAL_StatusTypeDef USB_HS_PHYCDeInit(void) {
	/* reset */
	RCC->APB4RSTSETR = RCC_APB4RSTSETR_USBPHYRST;
	RCC->APB4RSTCLRR = RCC_APB4RSTCLRR_USBPHYRST;
	/* turn clock off */
	RCC->MP_APB4ENCLRR = RCC_MP_APB4ENCLRR_USBPHYEN;
	RCC->MP_APB4LPENCLRR = RCC_MP_APB4LPENCLRR_USBPHYLPEN;
	return HAL_OK;
}

// Modification here: Function from hftrx
HAL_StatusTypeDef USB_HS_PHYCInit(void) {
	// Enable USBPHY
	RCC->MP_APB4ENSETR = RCC_MP_APB4ENSETR_USBPHYEN;
	RCC->MP_APB4LPENSETR = RCC_MP_APB4LPENSETR_USBPHYLPEN;

	// https://github.com/Xilinx/u-boot-xlnx/blob/master/drivers/phy/phy-stm32-usbphyc.c
	const uint_fast32_t USBPHYCPLLFREQUENCY = 1440000000uL; // 1.44 GHz
	const uint_fast32_t usbphyref = LL_RCC_GetUSBPHYClockFreq(LL_RCC_USBPHY_CLKSOURCE);
	const uint_fast32_t ODF = 0;
	const ldiv_t d = ldiv(USBPHYCPLLFREQUENCY / 4, usbphyref / 4);
	const uint_fast32_t N = d.quot; //0b0111100;

	const uint_fast32_t FRACTMAX = (USBPHYC_PLL_PLLFRACIN_Msk >> USBPHYC_PLL_PLLFRACIN_Pos) + 1;
	const uint_fast32_t FRACT = d.rem * (uint_fast64_t)FRACTMAX / usbphyref;

	const uint32_t validmask = USBPHYC_PLL_PLLDITHEN1_Msk | USBPHYC_PLL_PLLDITHEN0_Msk | USBPHYC_PLL_PLLFRACCTL_Msk |
							   USBPHYC_PLL_PLLFRACIN_Msk | USBPHYC_PLL_PLLODF_Msk | USBPHYC_PLL_PLLNDIV_Msk |
							   USBPHYC_PLL_PLLSTRBYP_Msk | 0;

	const uint32_t PLLFRACCTL_VAL = (d.rem == 0) ? 0 : USBPHYC_PLL_PLLFRACCTL_Msk;
	const uint32_t newPLLvalue = ((N << USBPHYC_PLL_PLLNDIV_Pos) & USBPHYC_PLL_PLLNDIV_Msk) | 
								 (ODF << USBPHYC_PLL_PLLODF_Pos) | 
								 ((FRACT << USBPHYC_PLL_PLLFRACIN_Pos) & USBPHYC_PLL_PLLFRACIN_Msk) |
								 PLLFRACCTL_VAL | 
								 USBPHYC_PLL_PLLSTRBYP_Msk | USBPHYC_PLL_PLLDITHEN0_Msk | USBPHYC_PLL_PLLDITHEN1_Msk;

	if ((newPLLvalue & validmask) != (USBPHYC->PLL & validmask) || (USBPHYC->PLL & USBPHYC_PLL_PLLEN_Msk) == 0) {
		USBPHYC->PLL &= ~USBPHYC_PLL_PLLEN_Msk;
		while ((USBPHYC->PLL & USBPHYC_PLL_PLLEN_Msk) != 0)
			;
		USBPHYC->PLL = (USBPHYC->PLL & ~(validmask)) | newPLLvalue;
		USBPHYC->PLL |= USBPHYC_PLL_PLLEN_Msk;
		HAL_Delay(10);
		while ((USBPHYC->PLL & USBPHYC_PLL_PLLEN_Msk) == 0)
			;
	}
	return HAL_OK;
}

/**
 * @brief  Initializes the USB Core
 * @param  USBx USB Instance
 * @param  cfg pointer to a USB_OTG_CfgTypeDef structure that contains
 *         the configuration information for the specified USBx peripheral.
 * @retval HAL status
 */
HAL_StatusTypeDef USB_CoreInit(USB_OTG_GlobalTypeDef *USBx, USB_OTG_CfgTypeDef cfg) {
	HAL_StatusTypeDef ret;
	if (cfg.phy_itface == USB_OTG_ULPI_PHY) {
		USBx->GCCFG &= ~(USB_OTG_GCCFG_PWRDWN);

		/* Init The ULPI Interface */
		USBx->GUSBCFG &= ~(USB_OTG_GUSBCFG_TSDPS | USB_OTG_GUSBCFG_ULPIFSLS | USB_OTG_GUSBCFG_PHYSEL);

		/* Select vbus source */
		USBx->GUSBCFG &= ~(USB_OTG_GUSBCFG_ULPIEVBUSD | USB_OTG_GUSBCFG_ULPIEVBUSI);
		if (cfg.use_external_vbus == 1U) {
			USBx->GUSBCFG |= USB_OTG_GUSBCFG_ULPIEVBUSD;
		}

		/* Reset after a PHY select */
		ret = USB_CoreReset(USBx);
	}

	//Note: Modification here: this else if{} block added
	else if (cfg.phy_itface == USB_OTG_HS_EMBEDDED_PHY)
	{
		//Power down PHY
		USBx->GCCFG &= ~(USB_OTG_GCCFG_PWRDWN);

		// During SRP, pulse DLine using utmi_txvalid
		USBx->GUSBCFG &= ~USB_OTG_GUSBCFG_TSDPS;

		// Use USB v2.0
		USBx->GUSBCFG &= ~USB_OTG_GUSBCFG_PHYSEL;

		//These are in the CMSIS-device file, but are undocumented:
		USBx->GUSBCFG &= ~USB_OTG_GUSBCFG_ULPIFSLS;
		USBx->GUSBCFG &= ~USB_OTG_GUSBCFG_ULPIEVBUSD;
		USBx->GUSBCFG &= ~USB_OTG_GUSBCFG_ULPIEVBUSI;
		USBx->GUSBCFG &= ~USB_OTG_GUSBCFG_ULPI_UTMI_SEL;
		USBx->GCCFG |= USB_OTG_GCCFG_PHYHSEN;

		USB_HS_PHYCInit();

		//This is in the CMSIS-device file, but is undocumented:
		if (cfg.use_external_vbus == ENABLE) {
			USBx->GUSBCFG |= USB_OTG_GUSBCFG_ULPIEVBUSD;
		}

