4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_ll_usb.c
		/* Reset after a PHY select  */
		ret = USB_CoreReset(USBx);

	}
	else /* FS interface (embedded Phy) */
	{
		/* Select FS Embedded PHY */
		USBx->GUSBCFG |= USB_OTG_GUSBCFG_PHYSEL;

		/* Reset after a PHY select */
		ret = USB_CoreReset(USBx);

		if (cfg.battery_charging_enable == 0U) {
			/* Activate the USB Transceiver */
			USBx->GCCFG |= USB_OTG_GCCFG_PWRDWN;
		} else {
			/* Deactivate the USB Transceiver */
			USBx->GCCFG &= ~(USB_OTG_GCCFG_PWRDWN);
		}
	}

	if (cfg.dma_enable == 1U) {
		/* make sure to reserve 18 fifo Locations for DMA buffers */
		// Modification here: GDFIFOCFG is not present on MP1, so these are commented out
		// USBx->GDFIFOCFG &= ~(0xFFFFU << 16);
		// USBx->GDFIFOCFG |= 0x3EEU << 16;

		USBx->GAHBCFG |= USB_OTG_GAHBCFG_HBSTLEN_2;
		USBx->GAHBCFG |= USB_OTG_GAHBCFG_DMAEN;
	}

	return ret;
}

/**
 * @brief  Set the USB turnaround time
 * @param  USBx USB Instance
 * @param  hclk: AHB clock frequency
 * @retval USB turnaround time In PHY Clocks number
 */
HAL_StatusTypeDef USB_SetTurnaroundTime(USB_OTG_GlobalTypeDef *USBx, uint32_t hclk, uint8_t speed) {
	uint32_t UsbTrd;

	/* The USBTRD is configured according to the tables below, depending on AHB frequency
	used by application. In the low AHB frequency range it is used to stretch enough the USB response
	time to IN tokens, the USB turnaround time, so to compensate for the longer AHB read access
	latency to the Data FIFO */
	if (speed == USBD_FS_SPEED) {
		if ((hclk >= 14200000U) && (hclk < 15000000U)) {
			/* hclk Clock Range between 14.2-15 MHz */
			UsbTrd = 0xFU;
		} else if ((hclk >= 15000000U) && (hclk < 16000000U)) {
			/* hclk Clock Range between 15-16 MHz */
			UsbTrd = 0xEU;
		} else if ((hclk >= 16000000U) && (hclk < 17200000U)) {
			/* hclk Clock Range between 16-17.2 MHz */
			UsbTrd = 0xDU;
		} else if ((hclk >= 17200000U) && (hclk < 18500000U)) {
			/* hclk Clock Range between 17.2-18.5 MHz */
			UsbTrd = 0xCU;
		} else if ((hclk >= 18500000U) && (hclk < 20000000U)) {
			/* hclk Clock Range between 18.5-20 MHz */
			UsbTrd = 0xBU;
		} else if ((hclk >= 20000000U) && (hclk < 21800000U)) {
			/* hclk Clock Range between 20-21.8 MHz */
			UsbTrd = 0xAU;
		} else if ((hclk >= 21800000U) && (hclk < 24000000U)) {
			/* hclk Clock Range between 21.8-24 MHz */
			UsbTrd = 0x9U;
		} else if ((hclk >= 24000000U) && (hclk < 27700000U)) {
			/* hclk Clock Range between 24-27.7 MHz */
			UsbTrd = 0x8U;
		} else if ((hclk >= 27700000U) && (hclk < 32000000U)) {
			/* hclk Clock Range between 27.7-32 MHz */
			UsbTrd = 0x7U;
		} else /* if(hclk >= 32000000) */ {
			/* hclk Clock Range between 32-200 MHz */
			UsbTrd = 0x6U;
		}
	} else if (speed == USBD_HS_SPEED) {
		UsbTrd = USBD_HS_TRDT_VALUE;
	} else {
		UsbTrd = USBD_DEFAULT_TRDT_VALUE;
	}

	USBx->GUSBCFG &= ~USB_OTG_GUSBCFG_TRDT_Msk;
	USBx->GUSBCFG |= (((uint32_t)UsbTrd << USB_OTG_GUSBCFG_TRDT_Pos) & USB_OTG_GUSBCFG_TRDT_Msk);

	return HAL_OK;
}

/**
 * @brief  USB_EnableGlobalInt
 *         Enables the controller's Global Int in the AHB Config reg
 * @param  USBx  Selected device
 * @retval HAL status
 */
HAL_StatusTypeDef USB_EnableGlobalInt(USB_OTG_GlobalTypeDef *USBx) {
	USBx->GAHBCFG |= USB_OTG_GAHBCFG_GINT;
	return HAL_OK;
}

/**
 * @brief  USB_DisableGlobalInt
 *         Disable the controller's Global Int in the AHB Config reg
 * @param  USBx  Selected device
 * @retval HAL status
 */
HAL_StatusTypeDef USB_DisableGlobalInt(USB_OTG_GlobalTypeDef *USBx) {
	USBx->GAHBCFG &= ~USB_OTG_GAHBCFG_GINT;
	return HAL_OK;
}

/**
 * @brief  USB_SetCurrentMode Set functional mode
 * @param  USBx  Selected device
 * @param  mode  current core mode
 *          This parameter can be one of these values:
 *            @arg USB_DEVICE_MODE Peripheral mode
 *            @arg USB_HOST_MODE Host mode
 * @retval HAL status
 */
HAL_StatusTypeDef USB_SetCurrentMode(USB_OTG_GlobalTypeDef *USBx, USB_OTG_ModeTypeDef mode) {
	uint32_t ms = 0U;

	USBx->GUSBCFG &= ~(USB_OTG_GUSBCFG_FHMOD | USB_OTG_GUSBCFG_FDMOD);

	if (mode == USB_HOST_MODE) {
		USBx->GUSBCFG |= USB_OTG_GUSBCFG_FHMOD;

		do {
			HAL_Delay(1U);
			ms++;
		} while ((USB_GetMode(USBx) != (uint32_t)USB_HOST_MODE) && (ms < 50U));
	} else if (mode == USB_DEVICE_MODE) {
		USBx->GUSBCFG |= USB_OTG_GUSBCFG_FDMOD;

		do {
			HAL_Delay(1U);
			ms++;
		} while ((USB_GetMode(USBx) != (uint32_t)USB_DEVICE_MODE) && (ms < 50U));
	} else {
		return HAL_ERROR;
	}

	if (ms == 50U) {
		return HAL_ERROR;
	}

	return HAL_OK;
}

/**
 * @brief  USB_DevInit Initializes the USB_OTG controller registers
 *         for device mode
 * @param  USBx  Selected device
 * @param  cfg   pointer to a USB_OTG_CfgTypeDef structure that contains
 *         the configuration information for the specified USBx peripheral.
 * @retval HAL status
 */
HAL_StatusTypeDef USB_DevInit(USB_OTG_GlobalTypeDef *USBx, USB_OTG_CfgTypeDef cfg) {
	HAL_StatusTypeDef ret = HAL_OK;
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t i;

	for (i = 0U; i < 15U; i++) {
		USBx->DIEPTXF[i] = 0U;
	}

	/* VBUS Sensing setup */
	if (cfg.vbus_sensing_enable == 0U) {
		USBx_DEVICE->DCTL |= USB_OTG_DCTL_SDIS;

		/* Deactivate VBUS Sensing B */
		USBx->GCCFG &= ~USB_OTG_GCCFG_VBDEN;

		/* B-peripheral session valid override enable */
		USBx->GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN;
		USBx->GOTGCTL |= USB_OTG_GOTGCTL_BVALOVAL;
	} else {
		/* Enable HW VBUS sensing */
		USBx->GCCFG |= USB_OTG_GCCFG_VBDEN;
	}

	/* Restart the Phy Clock */
	USBx_PCGCCTL = 0U;

	/* Device mode configuration */
	USBx_DEVICE->DCFG |= DCFG_FRAME_INTERVAL_80;

	if (cfg.phy_itface == USB_OTG_ULPI_PHY) {
		if (cfg.speed == USBD_HS_SPEED) {
			/* Set Core speed to High speed mode */
			(void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_HIGH);
		} else {
			/* Set Core speed to Full speed mode */
			(void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_HIGH_IN_FULL);
		}
	} 
	// Note: Modification to LL driver here: this else if{} block added (copied from above block)
	else if (cfg.phy_itface == USB_OTG_HS_EMBEDDED_PHY)
	{
		if (cfg.speed == USBD_HS_SPEED) {
			/* Set Core speed to High speed mode */
			(void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_HIGH);
		} else {
			/* Set Core speed to Full speed mode */
			(void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_HIGH_IN_FULL);
		}
	} else {
		/* Set Core speed to Full speed mode */
		(void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_FULL);
	}

	/* Flush the FIFOs */
	if (USB_FlushTxFifo(USBx, 0x10U) != HAL_OK) /* all Tx FIFOs */ {
		ret = HAL_ERROR;
	}

	if (USB_FlushRxFifo(USBx) != HAL_OK) {
		ret = HAL_ERROR;
	}

	/* Clear all pending Device Interrupts */
	USBx_DEVICE->DIEPMSK = 0U;
	USBx_DEVICE->DOEPMSK = 0U;
	USBx_DEVICE->DAINTMSK = 0U;

	for (i = 0U; i < cfg.dev_endpoints; i++) {
		if ((USBx_INEP(i)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) == USB_OTG_DIEPCTL_EPENA) {
			if (i == 0U) {
				USBx_INEP(i)->DIEPCTL = USB_OTG_DIEPCTL_SNAK;
			} else {
				USBx_INEP(i)->DIEPCTL = USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK;
			}
		} else {
			USBx_INEP(i)->DIEPCTL = 0U;
		}

		USBx_INEP(i)->DIEPTSIZ = 0U;
		USBx_INEP(i)->DIEPINT = 0xFB7FU;
	}

	for (i = 0U; i < cfg.dev_endpoints; i++) {
		if ((USBx_OUTEP(i)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA) {
			if (i == 0U) {
				USBx_OUTEP(i)->DOEPCTL = USB_OTG_DOEPCTL_SNAK;
			} else {
				USBx_OUTEP(i)->DOEPCTL = USB_OTG_DOEPCTL_EPDIS | USB_OTG_DOEPCTL_SNAK;
			}
		} else {
			USBx_OUTEP(i)->DOEPCTL = 0U;
		}

		USBx_OUTEP(i)->DOEPTSIZ = 0U;
		USBx_OUTEP(i)->DOEPINT = 0xFB7FU;
	}

	USBx_DEVICE->DIEPMSK &= ~(USB_OTG_DIEPMSK_TXFURM);

	/* Disable all interrupts. */
	USBx->GINTMSK = 0U;

	/* Clear any pending interrupts */
	USBx->GINTSTS = 0xBFFFFFFFU;

	/* Enable the common interrupts */
	if (cfg.dma_enable == 0U) {
		USBx->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM;
	}

	/* Enable interrupts matching to the Device mode ONLY */
	USBx->GINTMSK |= USB_OTG_GINTMSK_USBSUSPM | USB_OTG_GINTMSK_USBRST | USB_OTG_GINTMSK_ENUMDNEM |
					 USB_OTG_GINTMSK_IEPINT | USB_OTG_GINTMSK_OEPINT | USB_OTG_GINTMSK_IISOIXFRM |
					 USB_OTG_GINTMSK_PXFRM_IISOOXFRM | USB_OTG_GINTMSK_WUIM;

	if (cfg.Sof_enable != 0U) {
		USBx->GINTMSK |= USB_OTG_GINTMSK_SOFM;
	}

