4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_ll_usb.c
		/* EP enable */
		USBx_OUTEP(epnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
	}

	return HAL_OK;
}

/**
 * @brief  USB_EPStoptXfer  Stop transfer on an EP
 * @param  USBx  usb device instance
 * @param  ep pointer to endpoint structure
 * @retval HAL status
 */
HAL_StatusTypeDef USB_EPStopXfer(USB_OTG_GlobalTypeDef *USBx, USB_OTG_EPTypeDef *ep) {
	__IO uint32_t count = 0U;
	HAL_StatusTypeDef ret = HAL_OK;
	uint32_t USBx_BASE = (uint32_t)USBx;

	/* IN endpoint */
	if (ep->is_in == 1U) {
		/* EP enable, IN data in FIFO */
		if (((USBx_INEP(ep->num)->DIEPCTL) & USB_OTG_DIEPCTL_EPENA) == USB_OTG_DIEPCTL_EPENA) {
			USBx_INEP(ep->num)->DIEPCTL |= (USB_OTG_DIEPCTL_SNAK);
			USBx_INEP(ep->num)->DIEPCTL |= (USB_OTG_DIEPCTL_EPDIS);

			do {
				if (++count > 10000U) {
					ret = HAL_ERROR;
					break;
				}
			} while (((USBx_INEP(ep->num)->DIEPCTL) & USB_OTG_DIEPCTL_EPENA) == USB_OTG_DIEPCTL_EPENA);
		}
	} else /* OUT endpoint */ {
		if (((USBx_OUTEP(ep->num)->DOEPCTL) & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA) {
			USBx_OUTEP(ep->num)->DOEPCTL |= (USB_OTG_DOEPCTL_SNAK);
			USBx_OUTEP(ep->num)->DOEPCTL |= (USB_OTG_DOEPCTL_EPDIS);

			do {
				if (++count > 10000U) {
					ret = HAL_ERROR;
					break;
				}
			} while (((USBx_OUTEP(ep->num)->DOEPCTL) & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA);
		}
	}

	return ret;
}

/**
 * @brief  USB_WritePacket : Writes a packet into the Tx FIFO associated
 *         with the EP/channel
 * @param  USBx  Selected device
 * @param  src   pointer to source buffer
 * @param  ch_ep_num  endpoint or host channel number
 * @param  len  Number of bytes to write
 * @param  dma USB dma enabled or disabled
 *          This parameter can be one of these values:
 *           0 : DMA feature not used
 *           1 : DMA feature used
 * @retval HAL status
 */
HAL_StatusTypeDef
USB_WritePacket(USB_OTG_GlobalTypeDef *USBx, uint8_t *src, uint8_t ch_ep_num, uint16_t len, uint8_t dma) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint8_t *pSrc = src;
	uint32_t count32b;
	uint32_t i;

	if (dma == 0U) {
		count32b = ((uint32_t)len + 3U) / 4U;
		for (i = 0U; i < count32b; i++) {
			USBx_DFIFO((uint32_t)ch_ep_num) = __UNALIGNED_UINT32_READ(pSrc);
			pSrc++;
			pSrc++;
			pSrc++;
			pSrc++;
		}
	}

	return HAL_OK;
}

/**
 * @brief  USB_ReadPacket : read a packet from the RX FIFO
 * @param  USBx  Selected device
 * @param  dest  source pointer
 * @param  len  Number of bytes to read
 * @retval pointer to destination buffer
 */
void *USB_ReadPacket(USB_OTG_GlobalTypeDef *USBx, uint8_t *dest, uint16_t len) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint8_t *pDest = dest;
	uint32_t pData;
	uint32_t i;
	uint32_t count32b = (uint32_t)len >> 2U;
	uint16_t remaining_bytes = len % 4U;

	for (i = 0U; i < count32b; i++) {
		__UNALIGNED_UINT32_WRITE(pDest, USBx_DFIFO(0U));
		pDest++;
		pDest++;
		pDest++;
		pDest++;
	}

	/* When Number of data is not word aligned, read the remaining byte */
	if (remaining_bytes != 0U) {
		i = 0U;
		__UNALIGNED_UINT32_WRITE(&pData, USBx_DFIFO(0U));

		do {
			*(uint8_t *)pDest = (uint8_t)(pData >> (8U * (uint8_t)(i)));
			i++;
			pDest++;
			remaining_bytes--;
		} while (remaining_bytes != 0U);
	}

	return ((void *)pDest);
}

/**
 * @brief  USB_EPSetStall : set a stall condition over an EP
 * @param  USBx  Selected device
 * @param  ep pointer to endpoint structure
 * @retval HAL status
 */
HAL_StatusTypeDef USB_EPSetStall(USB_OTG_GlobalTypeDef *USBx, USB_OTG_EPTypeDef *ep) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t epnum = (uint32_t)ep->num;

	if (ep->is_in == 1U) {
		if (((USBx_INEP(epnum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) == 0U) && (epnum != 0U)) {
			USBx_INEP(epnum)->DIEPCTL &= ~(USB_OTG_DIEPCTL_EPDIS);
		}
		USBx_INEP(epnum)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
	} else {
		if (((USBx_OUTEP(epnum)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) == 0U) && (epnum != 0U)) {
			USBx_OUTEP(epnum)->DOEPCTL &= ~(USB_OTG_DOEPCTL_EPDIS);
		}
		USBx_OUTEP(epnum)->DOEPCTL |= USB_OTG_DOEPCTL_STALL;
	}

	return HAL_OK;
}

/**
 * @brief  USB_EPClearStall : Clear a stall condition over an EP
 * @param  USBx  Selected device
 * @param  ep pointer to endpoint structure
 * @retval HAL status
 */
HAL_StatusTypeDef USB_EPClearStall(USB_OTG_GlobalTypeDef *USBx, USB_OTG_EPTypeDef *ep) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t epnum = (uint32_t)ep->num;

	if (ep->is_in == 1U) {
		USBx_INEP(epnum)->DIEPCTL &= ~USB_OTG_DIEPCTL_STALL;
		if ((ep->type == EP_TYPE_INTR) || (ep->type == EP_TYPE_BULK)) {
			USBx_INEP(epnum)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM; /* DATA0 */
		}
	} else {
		USBx_OUTEP(epnum)->DOEPCTL &= ~USB_OTG_DOEPCTL_STALL;
		if ((ep->type == EP_TYPE_INTR) || (ep->type == EP_TYPE_BULK)) {
			USBx_OUTEP(epnum)->DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM; /* DATA0 */
		}
	}
	return HAL_OK;
}

/**
 * @brief  USB_StopDevice : Stop the usb device mode
 * @param  USBx  Selected device
 * @retval HAL status
 */
HAL_StatusTypeDef USB_StopDevice(USB_OTG_GlobalTypeDef *USBx) {
	HAL_StatusTypeDef ret;
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t i;

	/* Clear Pending interrupt */
	for (i = 0U; i < 15U; i++) {
		USBx_INEP(i)->DIEPINT = 0xFB7FU;
		USBx_OUTEP(i)->DOEPINT = 0xFB7FU;
	}

	/* Clear interrupt masks */
	USBx_DEVICE->DIEPMSK = 0U;
	USBx_DEVICE->DOEPMSK = 0U;
	USBx_DEVICE->DAINTMSK = 0U;

	/* Flush the FIFO */
	ret = USB_FlushRxFifo(USBx);
	if (ret != HAL_OK) {
		return ret;
	}

	ret = USB_FlushTxFifo(USBx, 0x10U);
	if (ret != HAL_OK) {
		return ret;
	}

	return ret;
}

/**
 * @brief  USB_SetDevAddress : Stop the usb device mode
 * @param  USBx  Selected device
 * @param  address  new device address to be assigned
 *          This parameter can be a value from 0 to 255
 * @retval HAL status
 */
HAL_StatusTypeDef USB_SetDevAddress(USB_OTG_GlobalTypeDef *USBx, uint8_t address) {
	uint32_t USBx_BASE = (uint32_t)USBx;

	USBx_DEVICE->DCFG &= ~(USB_OTG_DCFG_DAD);
	USBx_DEVICE->DCFG |= ((uint32_t)address << 4) & USB_OTG_DCFG_DAD;

	return HAL_OK;
}

/**
 * @brief  USB_DevConnect : Connect the USB device by enabling Rpu
 * @param  USBx  Selected device
 * @retval HAL status
 */
HAL_StatusTypeDef USB_DevConnect(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t USBx_BASE = (uint32_t)USBx;

	/* In case phy is stopped, ensure to ungate and restore the phy CLK */
	USBx_PCGCCTL &= ~(USB_OTG_PCGCCTL_STOPCLK | USB_OTG_PCGCCTL_GATECLK);

	USBx_DEVICE->DCTL &= ~USB_OTG_DCTL_SDIS;

	return HAL_OK;
}

/**
 * @brief  USB_DevDisconnect : Disconnect the USB device by disabling Rpu
 * @param  USBx  Selected device
 * @retval HAL status
 */
HAL_StatusTypeDef USB_DevDisconnect(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t USBx_BASE = (uint32_t)USBx;

	/* In case phy is stopped, ensure to ungate and restore the phy CLK */
	USBx_PCGCCTL &= ~(USB_OTG_PCGCCTL_STOPCLK | USB_OTG_PCGCCTL_GATECLK);

	USBx_DEVICE->DCTL |= USB_OTG_DCTL_SDIS;

	return HAL_OK;
}

/**
 * @brief  USB_ReadInterrupts: return the global USB interrupt status
 * @param  USBx  Selected device
 * @retval HAL status
 */
uint32_t USB_ReadInterrupts(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t tmpreg;

	tmpreg = USBx->GINTSTS;
	tmpreg &= USBx->GINTMSK;

	return tmpreg;
}

/**
 * @brief  USB_ReadDevAllOutEpInterrupt: return the USB device OUT endpoints interrupt status
 * @param  USBx  Selected device
 * @retval HAL status
 */
uint32_t USB_ReadDevAllOutEpInterrupt(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t tmpreg;

	tmpreg = USBx_DEVICE->DAINT;
	tmpreg &= USBx_DEVICE->DAINTMSK;

	return ((tmpreg & 0xffff0000U) >> 16);
}

/**
 * @brief  USB_ReadDevAllInEpInterrupt: return the USB device IN endpoints interrupt status
 * @param  USBx  Selected device
 * @retval HAL status
 */
uint32_t USB_ReadDevAllInEpInterrupt(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t tmpreg;

	tmpreg = USBx_DEVICE->DAINT;
	tmpreg &= USBx_DEVICE->DAINTMSK;

	return ((tmpreg & 0xFFFFU));
}

/**
 * @brief  Returns Device OUT EP Interrupt register
 * @param  USBx  Selected device
 * @param  epnum  endpoint number
 *          This parameter can be a value from 0 to 15
 * @retval Device OUT EP Interrupt register
 */
uint32_t USB_ReadDevOutEPInterrupt(USB_OTG_GlobalTypeDef *USBx, uint8_t epnum) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t tmpreg;

	tmpreg = USBx_OUTEP((uint32_t)epnum)->DOEPINT;
	tmpreg &= USBx_DEVICE->DOEPMSK;

	return tmpreg;
}

/**
 * @brief  Returns Device IN EP Interrupt register
 * @param  USBx  Selected device
 * @param  epnum  endpoint number
 *          This parameter can be a value from 0 to 15
 * @retval Device IN EP Interrupt register
 */
uint32_t USB_ReadDevInEPInterrupt(USB_OTG_GlobalTypeDef *USBx, uint8_t epnum) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t tmpreg;
	uint32_t msk;
	uint32_t emp;

	msk = USBx_DEVICE->DIEPMSK;
	emp = USBx_DEVICE->DIEPEMPMSK;
	msk |= ((emp >> (epnum & EP_ADDR_MSK)) & 0x1U) << 7;
	tmpreg = USBx_INEP((uint32_t)epnum)->DIEPINT & msk;

	return tmpreg;
}

/**
 * @brief  USB_ClearInterrupts: clear a USB interrupt
 * @param  USBx  Selected device
 * @param  interrupt  flag
 * @retval None
 */
void USB_ClearInterrupts(USB_OTG_GlobalTypeDef *USBx, uint32_t interrupt) {
	USBx->GINTSTS |= interrupt;
}

/**
 * @brief  Returns USB core mode
 * @param  USBx  Selected device
 * @retval return core mode : Host or Device
 *          This parameter can be one of these values:
 *           0 : Host
 *           1 : Device
 */
uint32_t USB_GetMode(USB_OTG_GlobalTypeDef *USBx) {
	return ((USBx->GINTSTS) & 0x1U);
}

/**
 * @brief  Activate EP0 for Setup transactions
 * @param  USBx  Selected device
 * @retval HAL status
 */
HAL_StatusTypeDef USB_ActivateSetup(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t USBx_BASE = (uint32_t)USBx;

