4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_ll_usb.c
	/* Set the MPS of the IN EP0 to 64 bytes */
	USBx_INEP(0U)->DIEPCTL &= ~USB_OTG_DIEPCTL_MPSIZ;

	USBx_DEVICE->DCTL |= USB_OTG_DCTL_CGINAK;

	return HAL_OK;
}

/**
 * @brief  Prepare the EP0 to start the first control setup
 * @param  USBx  Selected device
 * @param  dma USB dma enabled or disabled
 *          This parameter can be one of these values:
 *           0 : DMA feature not used
 *           1 : DMA feature used
 * @param  psetup  pointer to setup packet
 * @retval HAL status
 */
HAL_StatusTypeDef USB_EP0_OutStart(USB_OTG_GlobalTypeDef *USBx, uint8_t dma, uint8_t *psetup) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t gSNPSiD = *(__IO uint32_t *)(&USBx->CID + 0x1U);

	if (gSNPSiD > USB_OTG_CORE_ID_300A) {
		if ((USBx_OUTEP(0U)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA) {
			return HAL_OK;
		}
	}

	USBx_OUTEP(0U)->DOEPTSIZ = 0U;
	USBx_OUTEP(0U)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1U << 19));
	USBx_OUTEP(0U)->DOEPTSIZ |= (3U * 8U);
	USBx_OUTEP(0U)->DOEPTSIZ |= USB_OTG_DOEPTSIZ_STUPCNT;

	if (dma == 1U) {
		USBx_OUTEP(0U)->DOEPDMA = (uint32_t)psetup;
		/* EP enable */
		USBx_OUTEP(0U)->DOEPCTL |= USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_USBAEP;
	}

	return HAL_OK;
}

/**
 * @brief  Reset the USB Core (needed after USB clock settings change)
 * @param  USBx  Selected device
 * @retval HAL status
 */
static HAL_StatusTypeDef USB_CoreReset(USB_OTG_GlobalTypeDef *USBx) {
	__IO uint32_t count = 0U;

	/* Wait for AHB master IDLE state. */
	do {
		if (++count > 200000U) {
			return HAL_TIMEOUT;
		}
	} while ((USBx->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U);

	/* Core Soft Reset */
	count = 0U;
	USBx->GRSTCTL |= USB_OTG_GRSTCTL_CSRST;

	do {
		if (++count > 200000U) {
			return HAL_OK;//return HAL_TIMEOUT; //Fake!
		}
	} while ((USBx->GRSTCTL & USB_OTG_GRSTCTL_CSRST) == USB_OTG_GRSTCTL_CSRST);

	return HAL_OK;
}

/**
 * @brief  USB_HostInit : Initializes the USB OTG controller registers
 *         for Host mode
 * @param  USBx  Selected device
 * @param  cfg   pointer to a USB_OTG_CfgTypeDef structure that contains
 *         the configuration information for the specified USBx peripheral.
 * @retval HAL status
 */
HAL_StatusTypeDef USB_HostInit(USB_OTG_GlobalTypeDef *USBx, USB_OTG_CfgTypeDef cfg) {
	HAL_StatusTypeDef ret = HAL_OK;
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t i;

	/* Restart the Phy Clock */
	USBx_PCGCCTL = 0U;

	/* Disable VBUS sensing */
	USBx->GCCFG &= ~(USB_OTG_GCCFG_VBDEN);

	/* Disable Battery chargin detector */
	USBx->GCCFG &= ~(USB_OTG_GCCFG_BCDEN);

	// CID:
	// H7: 0x0000 2300
	// MP1: 0x0000 4000
	// Modification here (from hftrx)
	if (USB_Is_OTG_HS(USBx))
	{
		if (cfg.speed == USBH_FSLS_SPEED) {
			/* Force Device Enumeration to FS/LS mode only */
			USBx_HOST->HCFG |= USB_OTG_HCFG_FSLSS;
		} else {
			/* Set default Max speed support */
			USBx_HOST->HCFG &= ~(USB_OTG_HCFG_FSLSS);
		}
	} else {
		/* Set default Max speed support */
		USBx_HOST->HCFG &= ~(USB_OTG_HCFG_FSLSS);
	}

	/* Make sure the FIFOs are flushed. */
	if (USB_FlushTxFifo(USBx, 0x10U) != HAL_OK) /* all Tx FIFOs */ {
		ret = HAL_ERROR;
	}

	if (USB_FlushRxFifo(USBx) != HAL_OK) {
		ret = HAL_ERROR;
	}

	/* Clear all pending HC Interrupts */
	for (i = 0U; i < cfg.Host_channels; i++) {
		USBx_HC(i)->HCINT = 0xFFFFFFFFU;
		USBx_HC(i)->HCINTMSK = 0U;
	}

	/* Modification here: Enable VBUS driving -- from hftrx */
	(void)USB_DriveVbus(USBx, 1U);
	HAL_Delay(200U);

	/* Disable all interrupts. */
	USBx->GINTMSK = 0U;

	/* Clear any pending interrupts */
	USBx->GINTSTS = 0xFFFFFFFFU;

	if (USB_Is_OTG_HS(USBx)) {
		/* set Rx FIFO size */
		USBx->GRXFSIZ = 0x200U;
		USBx->DIEPTXF0_HNPTXFSIZ = (uint32_t)(((0x100U << 16) & USB_OTG_NPTXFD) | 0x200U);
		USBx->HPTXFSIZ = (uint32_t)(((0xE0U << 16) & USB_OTG_HPTXFSIZ_PTXFD) | 0x300U);
	} else {
		/* set Rx FIFO size */
		USBx->GRXFSIZ = 0x80U;
		USBx->DIEPTXF0_HNPTXFSIZ = (uint32_t)(((0x60U << 16) & USB_OTG_NPTXFD) | 0x80U);
		USBx->HPTXFSIZ = (uint32_t)(((0x40U << 16) & USB_OTG_HPTXFSIZ_PTXFD) | 0xE0U);
	}

	/* Enable the common interrupts */
	if (cfg.dma_enable == 0U) {
		USBx->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM;
	}

	/* Enable interrupts matching to the Host mode ONLY */
	USBx->GINTMSK |= (USB_OTG_GINTMSK_PRTIM | USB_OTG_GINTMSK_HCIM | USB_OTG_GINTMSK_SOFM | USB_OTG_GINTSTS_DISCINT |
					  USB_OTG_GINTMSK_PXFRM_IISOOXFRM | USB_OTG_GINTMSK_WUIM);

	return ret;
}

/**
 * @brief  USB_InitFSLSPClkSel : Initializes the FSLSPClkSel field of the
 *         HCFG register on the PHY type and set the right frame interval
 * @param  USBx  Selected device
 * @param  freq  clock frequency
 *          This parameter can be one of these values:
 *           HCFG_48_MHZ : Full Speed 48 MHz Clock
 *           HCFG_6_MHZ : Low Speed 6 MHz Clock
 * @retval HAL status
 */
HAL_StatusTypeDef USB_InitFSLSPClkSel(USB_OTG_GlobalTypeDef *USBx, uint8_t freq) {
	uint32_t USBx_BASE = (uint32_t)USBx;

	USBx_HOST->HCFG &= ~(USB_OTG_HCFG_FSLSPCS);
	USBx_HOST->HCFG |= (uint32_t)freq & USB_OTG_HCFG_FSLSPCS;

	if (freq == HCFG_48_MHZ) {
		USBx_HOST->HFIR = 48000U;
	} else if (freq == HCFG_6_MHZ) {
		USBx_HOST->HFIR = 6000U;
	} else {
		/* ... */
	}

	return HAL_OK;
}

/**
 * @brief  USB_OTG_ResetPort : Reset Host Port
 * @param  USBx  Selected device
 * @retval HAL status
 * @note (1)The application must wait at least 10 ms
 *   before clearing the reset bit.
 */
HAL_StatusTypeDef USB_ResetPort(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t USBx_BASE = (uint32_t)USBx;

	__IO uint32_t hprt0 = 0U;

	hprt0 = USBx_HPRT0;

	hprt0 &= ~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET | USB_OTG_HPRT_PENCHNG | USB_OTG_HPRT_POCCHNG);

	USBx_HPRT0 = (USB_OTG_HPRT_PRST | hprt0);
	HAL_Delay(100U); /* See Note #1 */
	USBx_HPRT0 = ((~USB_OTG_HPRT_PRST) & hprt0);
	HAL_Delay(10U);

	return HAL_OK;
}

/**
 * @brief  USB_ResetPort2 : Reset Host Port without long delay
 * @param  USBx  Selected device
 * @retval HAL status
 * @note (1)The application must wait at least 10 ms
 *   before clearing the reset bit.
 */

// Modification here: Function from hftrx
HAL_StatusTypeDef USB_ResetPort2(USB_OTG_GlobalTypeDef *USBx, uint8_t resetActiveState) {
	uint32_t USBx_BASE = (uint32_t)USBx;

