4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_ll_usb.c
	__IO uint32_t hprt0 = 0U;

	hprt0 = USBx_HPRT0;

	hprt0 &=
		~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET | USB_OTG_HPRT_PENCHNG | USB_OTG_HPRT_POCCHNG | USB_OTG_HPRT_PRST);

	USBx_HPRT0 = (!!resetActiveState * USB_OTG_HPRT_PRST | hprt0);

	return HAL_OK;
}

/**
 * @brief  USB_DriveVbus : activate or de-activate vbus
 * @param  state  VBUS state
 *          This parameter can be one of these values:
 *           0 : Deactivate VBUS
 *           1 : Activate VBUS
 * @retval HAL status
 */
HAL_StatusTypeDef USB_DriveVbus(USB_OTG_GlobalTypeDef *USBx, uint8_t state) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	__IO uint32_t hprt0 = 0U;

	hprt0 = USBx_HPRT0;

	hprt0 &= ~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET | USB_OTG_HPRT_PENCHNG | USB_OTG_HPRT_POCCHNG);

	if (((hprt0 & USB_OTG_HPRT_PPWR) == 0U) && (state == 1U)) {
		USBx_HPRT0 = (USB_OTG_HPRT_PPWR | hprt0);
	}
	if (((hprt0 & USB_OTG_HPRT_PPWR) == USB_OTG_HPRT_PPWR) && (state == 0U)) {
		USBx_HPRT0 = ((~USB_OTG_HPRT_PPWR) & hprt0);
	}
	return HAL_OK;
}

/**
 * @brief  Return Host Core speed
 * @param  USBx  Selected device
 * @retval speed : Host speed
 *          This parameter can be one of these values:
 *            @arg HCD_SPEED_HIGH: High speed mode
 *            @arg HCD_SPEED_FULL: Full speed mode
 *            @arg HCD_SPEED_LOW: Low speed mode
 */
uint32_t USB_GetHostSpeed(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	__IO uint32_t hprt0 = 0U;

	hprt0 = USBx_HPRT0;
	return ((hprt0 & USB_OTG_HPRT_PSPD) >> 17);
}

/**
 * @brief  Return Host Current Frame number
 * @param  USBx  Selected device
 * @retval current frame number
 */
uint32_t USB_GetCurrentFrame(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t USBx_BASE = (uint32_t)USBx;

	return (USBx_HOST->HFNUM & USB_OTG_HFNUM_FRNUM);
}

/**
 * @brief  Initialize a host channel
 * @param  USBx  Selected device
 * @param  ch_num  Channel number
 *         This parameter can be a value from 1 to 15
 * @param  epnum  Endpoint number
 *          This parameter can be a value from 1 to 15
 * @param  dev_address  Current device address
 *          This parameter can be a value from 0 to 255
 * @param  speed  Current device speed
 *          This parameter can be one of these values:
 *            @arg USB_OTG_SPEED_HIGH: High speed mode
 *            @arg USB_OTG_SPEED_FULL: Full speed mode
 *            @arg USB_OTG_SPEED_LOW: Low speed mode
 * @param  ep_type  Endpoint Type
 *          This parameter can be one of these values:
 *            @arg EP_TYPE_CTRL: Control type
 *            @arg EP_TYPE_ISOC: Isochronous type
 *            @arg EP_TYPE_BULK: Bulk type
 *            @arg EP_TYPE_INTR: Interrupt type
 * @param  mps  Max Packet Size
 *          This parameter can be a value from 0 to 32K
 * @retval HAL state
 */
// Modification here:
// Last two parameters were added, taken from hftrx (tt_hubaddr, tt_prtaddr)
HAL_StatusTypeDef USB_HC_Init(USB_OTG_GlobalTypeDef *USBx,
							  uint8_t ch_num,
							  uint8_t epnum,
							  uint8_t dev_address,
							  uint8_t speed,
							  uint8_t ep_type,
							  uint16_t mps,
							  uint8_t tt_hubaddr,
							  uint8_t tt_prtaddr) {
	HAL_StatusTypeDef ret = HAL_OK;
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t HCcharEpDir;
	uint32_t HCcharLowSpeed;
	uint32_t HostCoreSpeed;

	/* Clear old interrupt conditions for this host channel. */
	USBx_HC((uint32_t)ch_num)->HCINT = 0xFFFFFFFFU;

	// Modification here: from hftrx:
	USBx_HC((uint32_t)ch_num)->HCSPLT =
		(USBx_HC((uint32_t)ch_num)->HCSPLT & ~(USB_OTG_HCSPLT_HUBADDR_Msk | USB_OTG_HCSPLT_PRTADDR_Msk)) |
		((uint32_t)tt_hubaddr < USB_OTG_HCSPLT_HUBADDR_Pos) | ((uint32_t)tt_prtaddr < USB_OTG_HCSPLT_PRTADDR_Pos) | 0;

	/* Enable channel interrupts required for this transfer. */
	switch (ep_type) {
		case EP_TYPE_CTRL:
		case EP_TYPE_BULK:
			USBx_HC((uint32_t)ch_num)->HCINTMSK = USB_OTG_HCINTMSK_XFRCM | USB_OTG_HCINTMSK_STALLM |
												  USB_OTG_HCINTMSK_TXERRM | USB_OTG_HCINTMSK_DTERRM |
												  USB_OTG_HCINTMSK_AHBERR | USB_OTG_HCINTMSK_NAKM;

			if ((epnum & 0x80U) == 0x80U) {
				USBx_HC((uint32_t)ch_num)->HCINTMSK |= USB_OTG_HCINTMSK_BBERRM;
			} else {

				// Modification here:
				if (USB_Is_OTG_HS(USBx))
				{
					USBx_HC((uint32_t)ch_num)->HCINTMSK |= USB_OTG_HCINTMSK_NYET | USB_OTG_HCINTMSK_ACKM;
				}
			}
			break;

		case EP_TYPE_INTR:
			USBx_HC((uint32_t)ch_num)->HCINTMSK =
				USB_OTG_HCINTMSK_XFRCM | USB_OTG_HCINTMSK_STALLM | USB_OTG_HCINTMSK_TXERRM | USB_OTG_HCINTMSK_DTERRM |
				USB_OTG_HCINTMSK_NAKM | USB_OTG_HCINTMSK_AHBERR | USB_OTG_HCINTMSK_FRMORM;

			if ((epnum & 0x80U) == 0x80U) {
				USBx_HC((uint32_t)ch_num)->HCINTMSK |= USB_OTG_HCINTMSK_BBERRM;
			}

			break;

		case EP_TYPE_ISOC:
			USBx_HC((uint32_t)ch_num)->HCINTMSK =
				USB_OTG_HCINTMSK_XFRCM | USB_OTG_HCINTMSK_ACKM | USB_OTG_HCINTMSK_AHBERR | USB_OTG_HCINTMSK_FRMORM;

			if ((epnum & 0x80U) == 0x80U) {
				USBx_HC((uint32_t)ch_num)->HCINTMSK |= (USB_OTG_HCINTMSK_TXERRM | USB_OTG_HCINTMSK_BBERRM);
			}
			break;

		default:
			ret = HAL_ERROR;
			break;
	}

	USBx_HC((uint32_t)ch_num)->HCINTMSK |= USB_OTG_HCINTMSK_CHHM;

	/* Enable the top level host channel interrupt. */
	USBx_HOST->HAINTMSK |= 1UL << (ch_num & 0xFU);

	/* Make sure host channel interrupts are enabled. */
	USBx->GINTMSK |= USB_OTG_GINTMSK_HCIM;

	/* Program the HCCHAR register */
	if ((epnum & 0x80U) == 0x80U) {
		HCcharEpDir = (0x1U << 15) & USB_OTG_HCCHAR_EPDIR;
	} else {
		HCcharEpDir = 0U;
	}

	HostCoreSpeed = USB_GetHostSpeed(USBx);

	/* LS device plugged to HUB */
	if ((speed == HPRT0_PRTSPD_LOW_SPEED) && (HostCoreSpeed != HPRT0_PRTSPD_LOW_SPEED)) {
		HCcharLowSpeed = (0x1U << 17) & USB_OTG_HCCHAR_LSDEV;
	} else {
		HCcharLowSpeed = 0U;
	}

	USBx_HC((uint32_t)ch_num)->HCCHAR = (((uint32_t)dev_address << 22) & USB_OTG_HCCHAR_DAD) |
										((((uint32_t)epnum & 0x7FU) << 11) & USB_OTG_HCCHAR_EPNUM) |
										(((uint32_t)ep_type << 18) & USB_OTG_HCCHAR_EPTYP) |
										((uint32_t)mps & USB_OTG_HCCHAR_MPSIZ) | HCcharEpDir | HCcharLowSpeed;

	if (ep_type == EP_TYPE_INTR) {
		USBx_HC((uint32_t)ch_num)->HCCHAR |= USB_OTG_HCCHAR_ODDFRM;
	}

	return ret;
}

/**
 * @brief  Start a transfer over a host channel
 * @param  USBx  Selected device
 * @param  hc  pointer to host channel structure
 * @param  dma USB dma enabled or disabled
 *          This parameter can be one of these values:
 *           0 : DMA feature not used
 *           1 : DMA feature used
 * @retval HAL state
 */
HAL_StatusTypeDef USB_HC_StartXfer(USB_OTG_GlobalTypeDef *USBx, USB_OTG_HCTypeDef *hc, uint8_t dma) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t ch_num = (uint32_t)hc->ch_num;
	__IO uint32_t tmpreg;
	uint8_t is_oddframe;
	uint16_t len_words;
	uint16_t num_packets;
	uint16_t max_hc_pkt_count = 256U;

	// CID:
	// H7: 0x0000 2300
	// MP1: 0x0000 4000
	// Modification to LL driver here:
	if ((USB_Is_OTG_HS(USBx)) && (hc->speed == USBH_HS_SPEED))
	{
		/* in DMA mode host Core automatically issues ping  in case of NYET/NAK */
		if ((dma == 1U) && ((hc->ep_type == EP_TYPE_CTRL) || (hc->ep_type == EP_TYPE_BULK))) {
			USBx_HC((uint32_t)ch_num)->HCINTMSK &=
				~(USB_OTG_HCINTMSK_NYET | USB_OTG_HCINTMSK_ACKM | USB_OTG_HCINTMSK_NAKM);
		}

		if ((dma == 0U) && (hc->do_ping == 1U)) {
			(void)USB_DoPing(USBx, hc->ch_num);
			return HAL_OK;
		}
	}

	/* Compute the expected number of packets associated to the transfer */
	if (hc->xfer_len > 0U) {
		num_packets = (uint16_t)((hc->xfer_len + hc->max_packet - 1U) / hc->max_packet);

		if (num_packets > max_hc_pkt_count) {
			num_packets = max_hc_pkt_count;
			hc->XferSize = (uint32_t)num_packets * hc->max_packet;
		}
	} else {
		num_packets = 1U;
	}

