4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_ll_usb.c
	/*
	 * For IN channel HCTSIZ.XferSize is expected to be an integer multiple of
	 * max_packet size.
	 */
	if (hc->ep_is_in != 0U) {
		hc->XferSize = (uint32_t)num_packets * hc->max_packet;
	} else {
		hc->XferSize = hc->xfer_len;
	}

	/* Initialize the HCTSIZn register */
	USBx_HC(ch_num)->HCTSIZ = (hc->XferSize & USB_OTG_HCTSIZ_XFRSIZ) |
							  (((uint32_t)num_packets << 19) & USB_OTG_HCTSIZ_PKTCNT) |
							  (((uint32_t)hc->data_pid << 29) & USB_OTG_HCTSIZ_DPID);

	if (dma != 0U) {
		/* xfer_buff MUST be 32-bits aligned */
		USBx_HC(ch_num)->HCDMA = (uint32_t)hc->xfer_buff;
	}

	is_oddframe = (((uint32_t)USBx_HOST->HFNUM & 0x01U) != 0U) ? 0U : 1U;
	USBx_HC(ch_num)->HCCHAR &= ~USB_OTG_HCCHAR_ODDFRM;
	USBx_HC(ch_num)->HCCHAR |= (uint32_t)is_oddframe << 29;

	/* Set host channel enable */
	tmpreg = USBx_HC(ch_num)->HCCHAR;
	tmpreg &= ~USB_OTG_HCCHAR_CHDIS;

	/* make sure to set the correct ep direction */
	if (hc->ep_is_in != 0U) {
		tmpreg |= USB_OTG_HCCHAR_EPDIR;
	} else {
		tmpreg &= ~USB_OTG_HCCHAR_EPDIR;
	}
	tmpreg |= USB_OTG_HCCHAR_CHENA;
	USBx_HC(ch_num)->HCCHAR = tmpreg;

	if (dma != 0U) /* dma mode */ {
		return HAL_OK;
	}

	if ((hc->ep_is_in == 0U) && (hc->xfer_len > 0U)) {
		switch (hc->ep_type) {
			/* Non periodic transfer */
			case EP_TYPE_CTRL:
			case EP_TYPE_BULK:

				len_words = (uint16_t)((hc->xfer_len + 3U) / 4U);

				/* check if there is enough space in FIFO space */
				if (len_words > (USBx->HNPTXSTS & 0xFFFFU)) {
					/* need to process data in nptxfempty interrupt */
					USBx->GINTMSK |= USB_OTG_GINTMSK_NPTXFEM;
				}
				break;

			/* Periodic transfer */
			case EP_TYPE_INTR:
			case EP_TYPE_ISOC:
				len_words = (uint16_t)((hc->xfer_len + 3U) / 4U);
				/* check if there is enough space in FIFO space */
				if (len_words > (USBx_HOST->HPTXSTS & 0xFFFFU)) /* split the transfer */ {
					/* need to process data in ptxfempty interrupt */
					USBx->GINTMSK |= USB_OTG_GINTMSK_PTXFEM;
				}
				break;

			default:
				break;
		}

		/* Write packet into the Tx FIFO. */
		(void)USB_WritePacket(USBx, hc->xfer_buff, hc->ch_num, (uint16_t)hc->xfer_len, 0);
	}

	return HAL_OK;
}

/**
 * @brief Read all host channel interrupts status
 * @param  USBx  Selected device
 * @retval HAL state
 */
uint32_t USB_HC_ReadInterrupt(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t USBx_BASE = (uint32_t)USBx;

	return ((USBx_HOST->HAINT) & 0xFFFFU);
}

/**
 * @brief  Halt a host channel
 * @param  USBx  Selected device
 * @param  hc_num  Host Channel number
 *         This parameter can be a value from 1 to 15
 * @retval HAL state
 */
HAL_StatusTypeDef USB_HC_Halt(USB_OTG_GlobalTypeDef *USBx, uint8_t hc_num) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t hcnum = (uint32_t)hc_num;
	__IO uint32_t count = 0U;
	uint32_t HcEpType = (USBx_HC(hcnum)->HCCHAR & USB_OTG_HCCHAR_EPTYP) >> 18;
	uint32_t ChannelEna = (USBx_HC(hcnum)->HCCHAR & USB_OTG_HCCHAR_CHENA) >> 31;

	if (((USBx->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) == USB_OTG_GAHBCFG_DMAEN) && (ChannelEna == 0U)) {
		return HAL_OK;
	}

	/* Check for space in the request queue to issue the halt. */
	if ((HcEpType == HCCHAR_CTRL) || (HcEpType == HCCHAR_BULK)) {
		USBx_HC(hcnum)->HCCHAR |= USB_OTG_HCCHAR_CHDIS;

		if ((USBx->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) == 0U) {
			if ((USBx->HNPTXSTS & (0xFFU << 16)) == 0U) {
				USBx_HC(hcnum)->HCCHAR &= ~USB_OTG_HCCHAR_CHENA;
				USBx_HC(hcnum)->HCCHAR |= USB_OTG_HCCHAR_CHENA;
				do {
					if (++count > 1000U) {
						break;
					}
				} while ((USBx_HC(hcnum)->HCCHAR & USB_OTG_HCCHAR_CHENA) == USB_OTG_HCCHAR_CHENA);
			} else {
				USBx_HC(hcnum)->HCCHAR |= USB_OTG_HCCHAR_CHENA;
			}
		}
	} else {
		USBx_HC(hcnum)->HCCHAR |= USB_OTG_HCCHAR_CHDIS;

		if ((USBx_HOST->HPTXSTS & (0xFFU << 16)) == 0U) {
			USBx_HC(hcnum)->HCCHAR &= ~USB_OTG_HCCHAR_CHENA;
			USBx_HC(hcnum)->HCCHAR |= USB_OTG_HCCHAR_CHENA;
			do {
				if (++count > 1000U) {
					break;
				}
			} while ((USBx_HC(hcnum)->HCCHAR & USB_OTG_HCCHAR_CHENA) == USB_OTG_HCCHAR_CHENA);
		} else {
			USBx_HC(hcnum)->HCCHAR |= USB_OTG_HCCHAR_CHENA;
		}
	}

	return HAL_OK;
}

/**
 * @brief  Initiate Do Ping protocol
 * @param  USBx  Selected device
 * @param  hc_num  Host Channel number
 *         This parameter can be a value from 1 to 15
 * @retval HAL state
 */
HAL_StatusTypeDef USB_DoPing(USB_OTG_GlobalTypeDef *USBx, uint8_t ch_num) {
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t chnum = (uint32_t)ch_num;
	uint32_t num_packets = 1U;
	uint32_t tmpreg;

	USBx_HC(chnum)->HCTSIZ = ((num_packets << 19) & USB_OTG_HCTSIZ_PKTCNT) | USB_OTG_HCTSIZ_DOPING;

	/* Set host channel enable */
	tmpreg = USBx_HC(chnum)->HCCHAR;
	tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
	tmpreg |= USB_OTG_HCCHAR_CHENA;
	USBx_HC(chnum)->HCCHAR = tmpreg;

	return HAL_OK;
}

/**
 * @brief  Stop Host Core
 * @param  USBx  Selected device
 * @retval HAL state
 */
HAL_StatusTypeDef USB_StopHost(USB_OTG_GlobalTypeDef *USBx) {
	HAL_StatusTypeDef ret = HAL_OK;
	uint32_t USBx_BASE = (uint32_t)USBx;
	__IO uint32_t count = 0U;
	uint32_t value;
	uint32_t i;

	(void)USB_DisableGlobalInt(USBx);

	/* Flush USB FIFO */
	if (USB_FlushTxFifo(USBx, 0x10U) != HAL_OK) /* all Tx FIFOs */ {
		ret = HAL_ERROR;
	}

	if (USB_FlushRxFifo(USBx) != HAL_OK) {
		ret = HAL_ERROR;
	}

	/* Flush out any leftover queued requests. */
	for (i = 0U; i <= 15U; i++) {
		value = USBx_HC(i)->HCCHAR;
		value |= USB_OTG_HCCHAR_CHDIS;
		value &= ~USB_OTG_HCCHAR_CHENA;
		value &= ~USB_OTG_HCCHAR_EPDIR;
		USBx_HC(i)->HCCHAR = value;
	}

	/* Halt all channels to put them into a known state. */
	for (i = 0U; i <= 15U; i++) {
		value = USBx_HC(i)->HCCHAR;
		value |= USB_OTG_HCCHAR_CHDIS;
		value |= USB_OTG_HCCHAR_CHENA;
		value &= ~USB_OTG_HCCHAR_EPDIR;
		USBx_HC(i)->HCCHAR = value;

		do {
			if (++count > 1000U) {
				break;
			}
		} while ((USBx_HC(i)->HCCHAR & USB_OTG_HCCHAR_CHENA) == USB_OTG_HCCHAR_CHENA);
	}

	/* Clear any pending Host interrupts */
	USBx_HOST->HAINT = 0xFFFFFFFFU;
	USBx->GINTSTS = 0xFFFFFFFFU;

	(void)USB_EnableGlobalInt(USBx);

	return ret;
}

/**
 * @brief  USB_ActivateRemoteWakeup active remote wakeup signalling
 * @param  USBx Selected device
 * @retval HAL status
 */
HAL_StatusTypeDef USB_ActivateRemoteWakeup(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t USBx_BASE = (uint32_t)USBx;

	if ((USBx_DEVICE->DSTS & USB_OTG_DSTS_SUSPSTS) == USB_OTG_DSTS_SUSPSTS) {
		/* active Remote wakeup signalling */
		USBx_DEVICE->DCTL |= USB_OTG_DCTL_RWUSIG;
	}

	return HAL_OK;
}

/**
 * @brief  USB_DeActivateRemoteWakeup de-active remote wakeup signalling
 * @param  USBx Selected device
 * @retval HAL status
 */
HAL_StatusTypeDef USB_DeActivateRemoteWakeup(USB_OTG_GlobalTypeDef *USBx) {
	uint32_t USBx_BASE = (uint32_t)USBx;

	/* active Remote wakeup signalling */
	USBx_DEVICE->DCTL &= ~(USB_OTG_DCTL_RWUSIG);

	return HAL_OK;
}
#endif /* defined (USB_OTG_FS) || defined (USB_OTG_HS) */

/**
 * @}
 */

// Modification here:
// Function from hftrx
uint_fast8_t USB_Is_OTG_HS(USB_OTG_GlobalTypeDef *USBx) {
	return 1;
}

/**
 * @}
 */
#endif /* defined (USB_OTG_FS) || defined (USB_OTG_HS) */
#endif /* defined (HAL_PCD_MODULE_ENABLED) || defined (HAL_HCD_MODULE_ENABLED) */

/**
 * @}
 */
